a=pd.getConfig("ad","gg")
b="3"
if a ~= b then
pd.setConfig("ad","gg",b)
pd.messagebox("1.此版的下载服务已停止维护，您使用的下载服务由给你的第三方提供\n请您自行确认，如可以高速下载不要登录账号\n2.只有QWQ,漠然和凉生才在Telegram向我确认，其他版本概不负责\n3.您的账号不会泄漏，但第三方下载器有限速风险，限速后果由您自行承担\n如果觉得泄漏了你的隐私，请不要使用，这工具也不是给你这种人修的\n4.不要在Telegram求密钥，询问如何使用，将会以封禁处理\n5.安全防护软件请选择火绒，误报少，不拦截\n6.有可能会有新版，但同样不会在国内发布\n7.软件大妈里外恰烂钱，攻击同行，必会招报应，泄漏账号应该优先考虑他，身正不怕影子歪\n我的所有版本在Github和Telegram发布的都没有任何问题，没有收取一分钱\n白眼狼请耗子尾汁","重要通知")
--pd.messagebox("https://www.bilibili.com/read/cv10958106\n这也是我停更的原因之一\n使用过软件大妈脚本的尽量改密，您的账号很有可能已经被泄漏了","无恶不作的软件大妈")
--pd.system("explorer https://www.bilibili.com/read/cv10958106")
end